erp3l/src/Enums/ВидыПризнанияРасходовПоИсследованиямИРазработкам/ВидыПризнанияРасходовПоИсследованиямИРазработкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПризнанияРасходовПоИсследованиямИРазработкам</name>
  <enumValues>
    <name>ПризнаниеВСоставеНМА</name>
  </enumValues>
  <enumValues>
    <name>ПереносНаДругуюТему</name>
  </enumValues>
  <enumValues>
    <name>ВключитьВСоставПроизводственныхЗатрат</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытьТему</name>
  </enumValues>
  <enumValues>
    <name>НеВыполнятьПризнаниеРасходов</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеВСоставеРБП</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеВСоставеТекущихРасходов</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Enums/ТипыРасходов/ТипыРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРасходов</name>
  <enumValues>
    <name>ЗакупкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>СкладскоеХранение</name>
  </enumValues>
  <enumValues>
    <name>ПродажаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПродукции</name>
  </enumValues>
  <enumValues>
    <name>Производственные</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеСтоимостиВНА</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ВозникновениеЗатратНаОбъектах</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Enums/ВариантыРаспределенияРасходов/ВариантыРаспределенияРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРаспределенияРасходов</name>
  <enumValues>
    <name>НаСебестоимостьТоваров</name>
  </enumValues>
  <enumValues>
    <name>НаСебестоимостьПроизводства</name>
  </enumValues>
  <enumValues>
    <name>НаПроизводственныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>НаВнеоборотныеАктивы</name>
  </enumValues>
  <enumValues>
    <name>НаСебестоимостьПродаж</name>
  </enumValues>
  <enumValues>
    <name>НаОбъектыВозникновенияЗатрат</name>
  </enumValues>
  <enumValues>
    <name>НаНаправленияДеятельности</name>
  </enumValues>
  <enumValues>
    <name>НаРасходыБудущихПериодов</name>
  </enumValues>
  <enumValues>
    <name>НеРаспределять</name>
  </enumValues>
  <enumValues>
    <name>НаПрочиеАктивы</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/CommonModules/УчетРасходовПоИсследованиямИРазработкамКлиент/Module.bsl
//@strict-types

#Область ПрограммныйИнтерфейс

// Процедура предназначена для установки параметров выбора статьи расходов признания по исследованиям и разработкам.
//
// Параметры:
//	Элемент - ПолеФормы - элемент, для которого устанавливаются параметры выбора:
//	*ПараметрыВыбора - ФиксированныйМассив -
//	ВидПризнания - ПеречислениеСсылка.ВидыПризнанияРасходовПоИсследованиямИРазработкам, Неопределено - вид признания расходов
//
Процедура УстановитьПараметрыВыбораСтатьиРасхода(Элемент, ВидПризнания = Неопределено) Экспорт

	ПараметрыВыбораСтатьи = Новый Массив();

	Если ВидПризнания = ПредопределенноеЗначение("Перечисление.ВидыПризнанияРасходовПоИсследованиямИРазработкам.ПризнаниеВСоставеНМА") Тогда
		ПараметрыВыбораСтатьи.Добавить(Новый ПараметрВыбора("Отбор.ТипРасходов", ПредопределенноеЗначение("Перечисление.ТипыРасходов.ФормированиеСтоимостиВНА")));
		ПараметрыВыбораСтатьи.Добавить(Новый ПараметрВыбора("Отбор.ВариантРаспределенияРасходовРегл", ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы")));
		ПараметрыВыбораСтатьи.Добавить(Новый ПараметрВыбора("Отбор.РасходыНаНМАиНИОКР", Истина));
		ПараметрыВыбораСтатьи.Добавить(Новый ПараметрВыбора("Отбор.РасходыНаИсследованияИРазработки", Ложь));
	ИначеЕсли ВидПризнания = ПредопределенноеЗначение("Перечисление.ВидыПризнанияРасходовПоИсследованиямИРазработкам.ПереносНаДругуюТему") Тогда
		ПараметрыВыбораСтатьи.Добавить(Новый ПараметрВыбора("Отбор.ТипРасходов", ПредопределенноеЗначение("Перечисление.ТипыРасходов.ФормированиеСтоимостиВНА")));
		ПараметрыВыбораСтатьи.Добавить(Новый ПараметрВыбора("Отбор.РасходыНаИсследованияИРазработки", Истина));
	ИначеЕсли ВидПризнания = ПредопределенноеЗначение("Перечисление.ВидыПризнанияРасходовПоИсследованиямИРазработкам.ВключитьВСоставПроизводственныхЗатрат") Тогда
		ПараметрыВыбораСтатьи.Добавить(Новый ПараметрВыбора("Отбор.ТипРасходов", ПредопределенноеЗначение("Перечисление.ТипыРасходов.Производственные")));
	ИначеЕсли ВидПризнания = ПредопределенноеЗначение("Перечисление.ВидыПризнанияРасходовПоИсследованиямИРазработкам.ЗакрытьТему") Тогда
		ВидыДеятельностиРасходов = Новый Массив();
		ВидыДеятельностиРасходов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДеятельностиРасходов.ОсновнаяИПрочаяДеятельность"));
		ВидыДеятельностиРасходов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДеятельностиРасходов.ПрочаяДеятельность"));
		ПараметрыВыбораСтатьи.Добавить(Новый ПараметрВыбора("Отбор.ВидДеятельностиРасходов", ВидыДеятельностиРасходов));
		ПараметрыВыбораСтатьи.Добавить(Новый ПараметрВыбора("Отбор.ТипРасходов", ПредопределенноеЗначение("Перечисление.ТипыРасходов.ПрочиеРасходы")));
	ИначеЕсли ВидПризнания = ПредопределенноеЗначение("Перечисление.ВидыПризнанияРасходовПоИсследованиямИРазработкам.ПризнаниеВСоставеРБП") Тогда
		ВидыДеятельностиРасходов = Новый Массив();
		ВидыДеятельностиРасходов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДеятельностиРасходов.ОсновнаяДеятельность"));
		ПараметрыВыбораСтатьи.Добавить(Новый ПараметрВыбора("Отбор.ВидДеятельностиРасходов", ВидыДеятельностиРасходов));
		ПараметрыВыбораСтатьи.Добавить(Новый ПараметрВыбора("Отбор.ВариантРаспределенияРасходовРегл", ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов")));
	Иначе
		ПараметрыВыбораСтатьи.Добавить(Новый ПараметрВыбора("Отбор.ТипРасходов", ПредопределенноеЗначение("Перечисление.ТипыРасходов.ПрочиеРасходы")));
		ПараметрыВыбораСтатьи.Добавить(Новый ПараметрВыбора("Отбор.ВариантРаспределенияРасходовРегл", ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности")));
	КонецЕсли;

	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораСтатьи);
	
КонецПроцедуры

#КонецОбласти
